cf/Catalogs/SavedSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>SavedSettings</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.UsersGroups</xr:Item>
				<xr:Item>Catalog.Users</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SettingType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SettingsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SetupObject</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SaveAutomatically</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseOnOpen</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SavePeriod</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OpenOnStart</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SettingsStorage</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SettingsKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Enums/AlertType.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>AlertType</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Warning</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Error</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/SavedSettings/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// MODULE VARIABLES

Var PropertiesStructure Export;

////////////////////////////////////////////////////////////////////////////////
// OBJECT EVENT HANDLERS

Procedure BeforeWrite(Cancel)
	
	Message = "";
	
	AllAttributesValueTable = Alerts.AlertsExpandAttributesValueTable(Alerts.AlertReturnPredefinedAttributesValueTableByObject(ThisObject),GetAttributesValueTableForValidation());
		
	Alerts.AlertDoCommonCheck(ThisObject,AllAttributesValueTable,,Cancel);
	
	If IsBlankString(SettingsKey) Then
		SettingsKey = String(New UUID);
	EndIf;	
	
	If Cancel Then
		Alerts.AddAlert(Nstr("en='Setting""';pl='Ustawienie""';ru='Настройка""'") + " " + Description + " " + Nstr("en='""could not be write:';pl='""nie zostało zapisane';ru='""не была сохранена'") + Message,,Cancel,ThisObject);
	EndIf;
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// EXPORT PROCEDURES AND FUNCTIONS FOR OBJECT

Function GetAttributesValueTableForValidation() Export
	
	AttributesStructure = New Structure("Owner, Description");
	
	If NOT IsFolder Then
		AttributesStructure.Insert("SetupObject");
	EndIf;

	Return Alerts.AlertCreateAttributesValueTableFromStructure(AttributesStructure, Enums.AlertType.Error);
	
EndFunction

Function ElementChecks(Cancel = Undefined) Export
	
	If NOT (IsInRole(Metadata.Roles.Role_SystemSettings) OR IsInRole(Metadata.Roles.Right_Administration_ConfigurationAdministration)) 
		AND Owner <> SessionParameters.CurrentUser Then
		Alerts.AddAlert( Nstr("en='User without administrative rights can save setting only for himself.';pl='Użytkownik bez administracyjnych uprawnień może zapisywać ustawienia jedynie dla siebie.';ru='Пользователь без прав администратора может сохранять только свои настройки.'"), Enums.AlertType.Error,Cancel,ThisObject);
	EndIf;	
	
EndFunction

Procedure OnCopy(CopiedObject)
	SettingsKey = New UUID;
	Owner = SessionParameters.CurrentUser;
EndProcedure



////////////////////////////////////////////////////////////////////////////////
// MAIN PROGRAMM

PropertiesStructure = New Structure();

PropertiesStructure.Insert("DeletionMark", "Deletion mark");
PropertiesStructure.Insert("Owner",        "User-owner");
PropertiesStructure.Insert("Parent",        "Settings group");
PropertiesStructure.Insert("Description",    "Description settings");

For each Attribute In Metadata.Catalogs.SavedSettings.Attributes Do
	PropertiesStructure.Insert(Attribute.Name, Attribute.Presentation());
EndDo;
